# 实现输入10个数字，并打印10个数的求和结果

# a = 1
# sum = 0
# while a <= 10:
#     b = float(input("请输入第%.0f个数："%a))
#     a += 1
#     sum += b
# print("总和为：",sum)



# 从键盘依次输入10个数，最后打印最大的数、10个数的和、和平均数。

# a = 1
# sum = 0
# max = 0
# while a <= 10:
#     b = int(input("请输入第%d个数："%a))
#     a += 1
#     sum += b
#     if max <= b:
#         max = b
# print("最大值为：",max)
# print("总和为：",sum)
# print("平均数为：",(sum/10))







# 使用random模块，如何产生 50~150之间的数？

# import random
# num = random.randint(50,150)
# print(num)



# 从键盘输入任意三边，判断是否能形成三角形，若可以，则判断形成什么三角形（结果判断：等腰，等边，直角，普通，不能形成三角形。）
# a = int(input("请输入边长a："))
# b = int(input("请输入边长b："))
# c = int(input("请输入边长c："))
# if a+b>c and a+c>b and b+c>a:
#     if a == b == c:
#         print("可以构成等边三角形")
#     elif a == b != c or a == c != b or b == c != a:
#         print("可以构成等腰三角形")
#     elif a**2 + b**2 == c**2 or a**2 + c**2 == b**2 or b**2 + c**2 == a**2:
#         print("可以构成直角三角形")
#     else:
#         print("可以构成普通三角形")
# else:
#     print("不能构成三角形")


# 有以下两个数，使用+，-号实现两个数的调换。
#                   A=56
#                   B=78
# 实现效果：
#                   A=78
#                   B=56
# A = 56
# B = 78
# B = A + B
# A = B - A
# B = B - A
# print("A =",A)
# print("B =",B)


# 实现登陆系统的三次密码输入错误锁定功能（用户名：root,密码：admin）
#
#
# name = "root"
# password = "admin"
#
# a = 3
#
# while True:
#     b = input("请输入用户名：")
#     c = input("请输入密码：")
#     if b == "root" and c == "admin":
#         print("登录成功！")
#         break
#     else:
#         a -= 1
#         print("用户名或密码错误！还有%d次机会！"%a)
#         if a == 0:
#             print ("密码错误三次！系统锁定！")
#             break


# 使用while编程实现求1~100以内的数的和！
# a = 1
# sum = 0
# while a <= 100:
#     sum += a
#     a += 1
# print("从1加到100的和为：",sum)



# 一只青蛙掉在井里了，井高20米，青蛙白天往上爬3米，晚上下滑2米，问第几天能出来？请编程求出。
# day = 1
# height = 0
# while True:
#     height += 3
#     if height >= 20:
#         break
#     height -= 2
#     day += 1
# print("第",day,"天可以出来")




# 有一个列表，[“北京”,”上海”,”广东”]
# 1)	将中国所有省会城市添加到上述列表中
# names = ["北京","上海","广东"]
# names.extend(["太原","济南","石家庄","长春","哈尔滨","沈阳","呼和浩特","乌鲁木齐","兰州","银川","西安","郑州","合肥","南京","杭州"
#              ,"福州","广州","南昌","海口","南宁","贵阳","长沙","武汉","成都","昆明","拉萨","西宁","天津","重庆","台北"])
# print(names)

# 2)	广东成为第二大发达城市，将广东排在上海前面
# names[1] = ("广东")
# names[2] = ("上海")
# print(names)
# 3)	[36710.36,35427.10,29863.23,29667.39,27665.36,27650.45,27620.38,25369.20]这是中国GDP排名前8的城市的GDP数值，请统计前8城市的GDP总和，平均GDP。

# gdp = [36710.36,35427.10,29863.23,29667.39,27665.36,27650.45,27620.38,25369.20]
# sum = 0
# a = 0
# while a <= 7:
#     sum += gdp[a]
#     a += 1
# print("GDP总和为：%.2f"%sum)
# print("平均GDP为：%.2f"%(sum/8))

# 有以下一个列表，求其中是5的倍数的和
# a = [1,5,21,30,15,9,30,24]
# sum = 0
# i = 0
# while i<=7:
#     if a[i]%5 == 0:
#         sum += a[i]
#     i += 1
# print("5的倍数的和为：",sum)